In [14]:
import pandas as pd

In [31]:
list_names = ['Arsene Wenger', 'Robin van Persie', 'Jack Wilshere', 'Aaron Ramsey', 'Theo Walcott']
df = pd.DataFrame(list_names)
df.columns = ['names']

In [37]:
df

              names
0     Arsene Wenger
1  Robin van Persie
2     Jack Wilshere
3      Aaron Ramsey
4      Theo Walcott

In [38]:
df.names.str.split(' ', expand = True)

        0         1       2
0  Arsene    Wenger    None
1   Robin       van  Persie
2    Jack  Wilshere    None
3   Aaron    Ramsey    None
4    Theo   Walcott    None

In [42]:
df['names'].str.split(' ').str[1]

0      Wenger
1         van
2    Wilshere
3      Ramsey
4     Walcott
Name: names, dtype: object